run/coFlow/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This application/dictionary controls:
// - optional: create new patches from boundary faces (either given as
//   a set of patches or as a faceSet)
// - always: order faces on coupled patches such that they are opposite. This
//   is done for all coupled faces, not just for any patches created.
// - optional: synchronise points on coupled patches.

// 1. Create cyclic:
// - specify where the faces should come from
// - specify the type of cyclic. If a rotational specify the rotationAxis
//   and centre to make matching easier
// - pointSync true to guarantee points to line up.

// 2. Correct incorrect cyclic:
// This will usually fail upon loading:
//  "face 0 area does not match neighbour 2 by 0.0100005%"
//  " -- possible face ordering problem."
// - change patch type from 'cyclic' to 'patch' in the polyMesh/boundary file.
// - loosen match tolerance to get case to load
// - regenerate cyclic as above


// Tolerance used in matching faces. Absolute tolerance is span of
// face times this factor. To load incorrectly matches meshes set this
// to a higher value.
matchTolerance 1E-5;

// Do a synchronisation of coupled points after creation of any patches.
pointSync true;

// Patches to create.
patches
(

    {
	name airInlet;

        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

	// How to construct: either from 'patches' or 'set'
        constructFrom set;

	// If constructFrom = set : name of faceSet
        set airInlet;
    }
    {
	name airOutlet;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set airOutlet;
    }
    {
	name airSides;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set airSides;
    }
    {
	name cathodeSides;

        // Type of new patch
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set cathodeSides;
    }
    {
	name cflSides;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set cflSides;
    }
    {
	name fuelInlet;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set fuelInlet;
    }
    {
	name fuelOutlet;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set fuelOutlet;
    }
    {
	name fuelSides;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set fuelSides;
    }
    {
	name anodeSides;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set anodeSides;
    }
    {
	name aflSides;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set aflSides;
    }
    {
	name electrolyteSides;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set electrolyteSides;
    }
    {
	name interconnectBottomSides;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set interconnectBottomSides;
    }
    {
	name interconnectBottom;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set interconnectBottom;
    }
    {
	name interconnectTopSides;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set interconnectTopSides;
    }
    {
	name interconnectTop;
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        set interconnectTop;
    }
);

// ************************************************************************* //
